DataProcessors/Documents/ОбменВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбменВалюты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенег</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиВалюты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВалютныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Documents/ОбменВалюты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ЗаполнитьКурсНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьКурсНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьКурсНаСервере()
    
    // 1. Проверка на заполнение данных
    Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
        Возврат;
    КонецЕсли;
    
    // Если дата документа не заполнена, берем текущую дату
    ДатаЗапроса = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
    
    // 2. Обработка рубля
    // Проверяем Код (стандартный) или КодВалюты (ваш реквизит), если нужно
    Если Объект.Валюта.Код = "RUB" Или Объект.Валюта.Наименование = "Рубль" Тогда
        Объект.Курс = 1;
        ПересчитатьСуммуВРублях();
        Возврат;
    КонецЕсли;
    
    // 3. Получаем курс через Виртуальную таблицу "СрезПоследних"
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ

    |	КурсыСрезПоследних.Курс КАК Курс
    |ИЗ
    |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &Валюта) КАК КурсыСрезПоследних";
    
    Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
    Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
    
    Результат = Запрос.Выполнить();
    
    Если Не Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Объект.Курс = Выборка.Курс;
    Иначе
        // Если курса в базе нет вообще
        Объект.Курс = 1;
        Сообщить("Курс для валюты " + Объект.Валюта + " не найден в регистре на " + Формат(ДатаЗапроса, "ДФ=dd.MM.yyyy") + ". Установлен курс 1.");
    КонецЕсли;
    
    // 4. Пересчет суммы
    ПересчитатьСуммуВРублях();
    
КонецПроцедуры
&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
    ПересчитатьСуммуВРублях();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуВРублях()
    
    Если Объект.Сумма > 0 И Объект.Курс > 0 Тогда
        Объект.СуммаВРублях = Объект.Сумма * Объект.Курс;
    Иначе
        Объект.СуммаВРублях = 0;
    КонецЕсли;
    
КонецПроцедуры
